; domain
(define (domain gripper)
  (:requirements :strips)
  (:predicates
    (room ?r)
    (ball ?b)
    (gripper ?g)
    (at-robby ?r)
    (at ?b ?r)
    (free ?g)
    (carry ?o ?g)
  )

  (:action move
    :parameters (?from ?to)
    :precondition (and (room ?from) (room ?to) (at-robby ?from))
    :effect (and (at-robby ?to)
      (not (at-robby ?from)))
  )

  (:action pick
    :parameters (?obj ?room ?gripper)
    :precondition (and (ball ?obj) (room ?room) (gripper ?gripper)
      (at ?obj ?room) (at-robby ?room) (free ?gripper))
    :effect (and (carry ?obj ?gripper)
      (not (at ?obj ?room))
      (not (free ?gripper)))
  )

  (:action drop
    :parameters (?obj ?room ?gripper)
    :precondition (and (ball ?obj) (room ?room) (gripper ?gripper)
      (carry ?obj ?gripper) (at-robby ?room))
    :effect (and (at ?obj ?room)
      (free ?gripper)
      (not (carry ?obj ?gripper)))
  )
)

; problem
(define (problem one_room_to_n_room_distributed_4_6)
    (:domain gripper)
    (:requirements :strips)
    (:objects ball1 ball2 ball3 ball4 ball5 ball6 gripper1 gripper2 room1 room2 room3 room4)
    (:init (at ball1 room1) (at ball2 room1) (at ball3 room1) (at ball4 room1) (at ball5 room1) (at ball6 room1) (at-robby room1) (ball ball1) (ball ball2) (ball ball3) (ball ball4) (ball ball5) (ball ball6) (free gripper1) (free gripper2) (gripper gripper1) (gripper gripper2) (room room1) (room room2) (room room3) (room room4))
    (:goal (and (free gripper1) (free gripper2) (at ball1 room1) (at ball2 room2) (at ball3 room3) (at ball4 room3) (at ball5 room4) (at ball6 room4)))
)

; plan
1. (pick ball2 room1 gripper1)
   deleted: (at ball2 room1) (free gripper1)
   added: (carry ball2 gripper1)
   goals met: 2 of 8
2. (move room1 room2)
   deleted: (at-robby room1)
   added: (at-robby room2)
   goals met: 2 of 8
3. (drop ball2 room2 gripper1)
   deleted: (carry ball2 gripper1)
   added: (at ball2 room2) (free gripper1)
   goals met: 4 of 8
4. (move room2 room1)
   deleted: (at-robby room2)
   added: (at-robby room1)
   goals met: 4 of 8
5. (pick ball3 room1 gripper1)
   deleted: (at ball3 room1) (free gripper1)
   added: (carry ball3 gripper1)
   goals met: 3 of 8
6. (move room1 room3)
   deleted: (at-robby room1)
   added: (at-robby room3)
   goals met: 3 of 8
7. (drop ball3 room3 gripper1)
   deleted: (carry ball3 gripper1)
   added: (at ball3 room3) (free gripper1)
   goals met: 5 of 8
8. (move room3 room1)
   deleted: (at-robby room3)
   added: (at-robby room1)
   goals met: 5 of 8
9. (pick ball4 room1 gripper1)
   deleted: (at ball4 room1) (free gripper1)
   added: (carry ball4 gripper1)
   goals met: 4 of 8
10. (move room1 room3)
   deleted: (at-robby room1)
   added: (at-robby room3)
   goals met: 4 of 8
11. (drop ball4 room3 gripper1)
   deleted: (carry ball4 gripper1)
   added: (at ball4 room3) (free gripper1)
   goals met: 6 of 8
12. (move room3 room1)
   deleted: (at-robby room3)
   added: (at-robby room1)
   goals met: 6 of 8
13. (pick ball5 room1 gripper1)
   deleted: (at ball5 room1) (free gripper1)
   added: (carry ball5 gripper1)
   goals met: 5 of 8
14. (move room1 room4)
   deleted: (at-robby room1)
   added: (at-robby room4)
   goals met: 5 of 8
15. (drop ball5 room4 gripper1)
   deleted: (carry ball5 gripper1)
   added: (at ball5 room4) (free gripper1)
   goals met: 7 of 8
16. (move room4 room1)
   deleted: (at-robby room4)
   added: (at-robby room1)
   goals met: 7 of 8
17. (pick ball6 room1 gripper1)
   deleted: (at ball6 room1) (free gripper1)
   added: (carry ball6 gripper1)
   goals met: 6 of 8
18. (move room1 room4)
   deleted: (at-robby room1)
   added: (at-robby room4)
   goals met: 6 of 8
19. (drop ball6 room4 gripper1)
   deleted: (carry ball6 gripper1)
   added: (at ball6 room4) (free gripper1)
   goals met: 8 of 8
